function calculate(model, color, width, height, driving) {
	//wooden MODELS ---------------------------
	let woodModels = new Array("25 мм", "50 мм");
	//var woodColordur = new Array("CLASSIC", "CITY");
	let modelCode = 0; // default model
	let totalPrice = 0;

	getModel();
	let error = checkBoundories(modelCode, width, height);
	return printFinalPrice(error);

	function getModel() {
		modelCode = woodModels.indexOf(model);	//models are the rows in  horizontalTable
	}

	function checkBoundories(model, width, height) {
		let errorMSG = "Зададените размери са извън позволената площ на продукта";
		let sqrtMeters = width * height / 10000;
		if (model == 0) {
			if (width < 30 || width > 240 || height < 30 || height > 300) {
				return errorMSG;
			}
		}
		else {
			if (width < 50 || width > 240 || height < 50 || height > 300) {
				return errorMSG;
			}
		}

		if (sqrtMeters > 4) {
			return errorMSG;
		}
	}

	function ConvertSizesWoodenBlinds(arg) {
		var local = Math.round(Math.ceil(arg) / 10);

		//local = local / 10;
		local = local - 3;

		if (local < 0) {
			local = 0;
		}
		return local;
	}

	function printFinalPrice(error) {
		if (error !== undefined) {
			return error
		}

		let squareMeters;
		let discount = 6;	//precent discount
		let StrVodeneChk = driving;

		let sizeWidth = ConvertSizesWoodenBlinds(width);
		let sizeHeight = ConvertSizesWoodenBlinds(height);

		let woodenBlindsPrices = [
			[61, 61, 68, 76, 83, 90, 97, 104, 113, 120, 127, 133, 141, 148, 156, 163, 170, 178, 185, 192, 199, 207],
			[61, 61, 68, 76, 83, 90, 97, 104, 113, 120, 127, 133, 141, 148, 173, 181, 190, 197, 207, 214, 222, 230],
			[64, 64, 74, 82, 90, 99, 107, 114, 122, 131, 139, 147, 156, 164, 190, 198, 208, 216, 227, 236, 245, 254],
			[70, 70, 78, 87, 97, 106, 116, 125, 135, 144, 153, 162, 171, 181, 207, 216, 227, 236, 247, 258, 268, 278],
			[75, 75, 84, 94, 104, 114, 125, 136, 145, 155, 164, 176, 186, 197, 223, 235, 246, 258, 268, 278, 291, 301],
			[78, 78, 90, 101, 113, 122, 135, 145, 156, 168, 178, 190, 201, 212, 240, 253, 265, 276, 289, 300, 313, 324],
			[83, 83, 95, 107, 120, 131, 144, 155, 168, 179, 192, 204, 216, 228, 258, 269, 283, 297, 309, 322, 336, 348],
			[87, 87, 100, 114, 125, 139, 153, 164, 178, 192, 204, 217, 230, 243, 274, 288, 302, 316, 330, 344, 359, 373],
			[93, 93, 106, 120, 133, 147, 162, 176, 190, 204, 217, 232, 246, 259, 291, 305, 321, 336, 351, 366, 381, 396],
			[97, 97, 112, 125, 141, 156, 171, 186, 201, 216, 230, 246, 261, 276, 308, 324, 340, 355, 371, 386, 404, 419],
			[100, 100, 116, 132, 148, 164, 181, 197, 212, 228, 243, 259, 276, 292, 324, 342, 359, 376, 393, 409, 426, 443],
			[106, 106, 122, 138, 155, 173, 190, 207, 223, 240, 258, 274, 291, 308, 342, 360, 377, 394, 413, 431, 449, 467],
			[109, 109, 127, 145, 163, 181, 198, 216, 235, 253, 270, 288, 305, 324, 359, 377, 396, 414, 432, 452, 470, 490],
			[114, 114, 132, 152, 170, 190, 208, 227, 246, 265, 283, 302, 321, 340, 375, 394, 414, 435, 454, 474, 493, 0],
			[118, 118, 138, 159, 178, 197, 216, 236, 256, 276, 297, 315, 336, 355, 393, 413, 432, 454, 475, 496, 0, 0],
			[122, 122, 144, 164, 184, 205, 227, 247, 268, 289, 224, 330, 351, 371, 409, 431, 452, 474, 498, 0, 0, 0],
			[127, 127, 148, 170, 192, 214, 236, 258, 278, 300, 322, 344, 366, 386, 426, 447, 470, 493, 0, 0, 0, 0],
			[132, 132, 154, 177, 199, 222, 245, 267, 290, 313, 336, 359, 381, 404, 443, 467, 489, 0, 0, 0, 0, 0],
			[137, 137, 159, 183, 207, 230, 253, 278, 301, 324, 347, 373, 396, 419, 460, 484, 0, 0, 0, 0, 0, 0],
			[140, 140, 164, 190, 214, 239, 263, 288, 312, 337, 361, 386, 411, 435, 476, 0, 0, 0, 0, 0, 0, 0],
			[145, 145, 170, 197, 221, 247, 273, 298, 323, 348, 375, 399, 426, 451, 0, 0, 0, 0, 0, 0, 0, 0],
			[150, 150, 176, 202, 229, 255, 281, 308, 335, 361, 386, 414, 442, 467, 0, 0, 0, 0, 0, 0, 0, 0],
			[153, 153, 181, 209, 236, 265, 291, 317, 346, 374, 400, 429, 455, 482, 0, 0, 0, 0, 0, 0, 0, 0],
			[159, 159, 186, 215, 243, 273, 300, 329, 357, 385, 413, 442, 470, 0, 0, 0, 0, 0, 0, 0, 0, 0],
			[163, 163, 192, 221, 251, 279, 309, 338, 368, 398, 426, 455, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
			[167, 167, 197, 228, 259, 288, 319, 348, 380, 409, 439, 470, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
			[171, 171, 204, 233, 266, 297, 328, 360, 391, 421, 452, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
			[176, 176, 208, 240, 274, 305, 337, 369, 401, 432, 462, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
		];
		squareMeters = sizeWidth * sizeHeight / 10000;
		if (squareMeters < 0.5) {
			squareMeters = 0.5;
		}

		totalPrice = woodenBlindsPrices[sizeWidth][sizeHeight];

		if (StrVodeneChk == 1) {
			totalPrice = totalPrice + 0;
		}

		if (modelCode == 0) {
			totalPrice *= 1;
		}
		else {
			totalPrice *= 1.40;
		}

		totalPrice -= totalPrice * (discount / 100);

		if (totalPrice == 0) {
			return "Зададените размери са извън позволените";
		}
		else {
			return totalPrice;
		}
	}
}

export default {
    calculate,
}
